In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Question 1
**Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [4]:
# filling the missing values
for i in np.where(df['FlightNumber'].isnull()):    
    for j in range(len(i)):
        df.loc[i[j], 'FlightNumber'] = df.loc[i[j]-1, 'FlightNumber'] + 10

In [5]:
# converting to int type
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [6]:
print(df['FlightNumber'])

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

# Question 2
**The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [7]:
From = df['From_To'].apply(lambda x: x.split('_')[0])      # grabbing the 'From' part
To = df['From_To'].apply(lambda x: x.split('_')[1])        # grabbing the 'To' part
data = {'From':From, 'To':To}
df_tmp = pd.DataFrame(data, columns=['From', 'To'])        # creating a temporary DataFrame
df_tmp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# Question 3
**Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

In [8]:
# converting every entry in the DataFrame to its title form
for col in df_tmp.columns:
    df_tmp[col] = df_tmp[col].apply(lambda x: x.title())
df_tmp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Question 4
**Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [9]:
# dropping the 'From_To' column
df.drop('From_To', axis=1, inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [10]:
# adding the 'From' and 'To' columns to the original DataFrame from the temporary DataFrame
for col in df_tmp.columns:
    df[col] = df_tmp[col]
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# Question 5
**In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, 
each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. \\
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.**

In [11]:
# first we find the number of columns required = maximum length of column entries
col_req = max(df['RecentDelays'].apply(lambda x: len(x)))
col_req

3

In [12]:
# creating the DataDrame delays
delays = pd.DataFrame()                                                
for i in range(col_req):
    delays['delay_'+str(i+1)] = df['RecentDelays'].apply(lambda x: x[i] if len(x)>i else np.NaN)

In [13]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [14]:
delays.columns

Index(['delay_1', 'delay_2', 'delay_3'], dtype='object')

In [15]:
# adding the 3 new columns to the DataFrame df from delays
for col in delays.columns:
    df[col] = delays[col]

In [16]:
# dropping the unwanted RecentDelays column from df
df.drop('RecentDelays', axis=1, inplace=True)

In [17]:
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]